<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title></title>
  <style type="text/css">code{white-space: pre;}</style>
  <style type="text/css">
  /*
      http://www.oschina.net/question/124879_76399
  */
  
  html { font-size: 100%; overflow-y: scroll; -webkit-text-size-adjust: 100%; -ms-text-size-adjust: 100%; }
   
  body{
      color:#444;
      font-family:Georgia, Palatino, 'Palatino Linotype', Times, 'Times New Roman', serif;
      font-size:13px;
      line-height:1.5em;
      padding:1em;
      margin:auto;
      max-width:42em;
      background:#fefefe;
  }
   
  h1, h2, h3, h4, h5, h6 {
      font-weight: bold;
  }
   
  h1 {
      color: #000000;
      font-size: 28px;
  }
   
  h2 {
      border-bottom: 2px solid #CCCCCC;
      color: #000000;
      font-size: 24px;
  }
   
  h3 {
      border-bottom: 2px solid #CCCCCC;
      font-size: 18px;
  }
   
  h4 {
      font-size: 16px;
  }
   
  h5 {
      font-size: 14px;
  }
   
  h6 {
      color: #777777;
      background-color: inherit;
      font-size: 14px;
  }
   
  hr {
      height: 0.2em;
      border: 0;
      color: #CCCCCC;
      background-color: #CCCCCC;
  }
   
  p, blockquote, ul, ol, dl, li, table, pre {
      margin: 15px 0;
  }
   
  p{
      margin:1em 0;
  }
   
  pre { 
      background-color: #F8F8F8;    
      border: 1px solid #CCCCCC;
      border-radius: 3px;
      overflow: auto;
      padding: 5px;
  }
   
  pre code {
      background-color: #F8F8F8;
      border: none;    
      padding: 0;
  }
   
  code {
      font-family: Consolas, Monaco, Andale Mono, monospace;
      background-color:#F8F8F8;
      border: 1px solid #CCCCCC;
      border-radius: 3px;
      padding: 0 0.2em;
      line-height: 1;
  }
   
  pre > code {
      border: 0;
      margin: 0;
      padding: 0;
  }
   
   
  a{ color: #0645ad; text-decoration:none;}
  a:visited{ color: #0b0080; }
  a:hover{ color: #06e; }
  a:active{ color:#faa700; }
  a:focus{ outline: thin dotted; }
  a:hover, a:active{ outline: 0; }
   
  ::-moz-selection{background:rgba(255,255,0,0.3);color:#000}
  ::selection{background:rgba(255,255,0,0.3);color:#000}
   
  a::-moz-selection{background:rgba(255,255,0,0.3);color:#0645ad}
  a::selection{background:rgba(255,255,0,0.3);color:#0645ad}
   
  blockquote{
      color:#666666;
      margin:0;
      padding-left: 3em;
      border-left: 0.5em #EEE solid;
  }
   
  ul, ol { margin: 1em 0; padding: 0 0 0 2em; }
  li p:last-child { margin:0 }
  dd { margin: 0 0 0 2em; }
   
  img { border: 0; -ms-interpolation-mode: bicubic; vertical-align: middle; max-width:100%;}
   
  table { border-collapse: collapse; border-spacing: 0; }
  td { vertical-align: top; }
   
  @media only screen and (min-width: 480px) {
      body{font-size:14px;}
  }
   
  @media only screen and (min-width: 768px) {
      body{font-size:16px;}
  }
  </style>
</head>
<body>
<h1 id="&#20010;&#20154;&#21382;&#24180;&#39033;&#30446;&#24635;&#32467;"><strong>&#20010;&#20154;&#21382;&#24180;&#39033;&#30446;&#24635;&#32467;</strong></h1>
<hr />
<H2>
<ol style="list-style-type: decimal">
<li>&#37202;&#24215;&#33258;&#21161;&#26426;&#32456;&#31471;&#31995;&#32479;
</H2></li>
</ol>
<p><strong>&#39033;&#30446;&#31616;&#20171;&#65306;</strong></p>
<p>&#8195;&#8195;&#37202;&#24215;&#33258;&#21161;&#26426;&#32456;&#31471;&#31995;&#32479;&#26159;&#20026;&#20102;&#26041;&#20415;&#37202;&#24215;&#23458;&#25143;&#33258;&#21161;&#20837;&#20303;&#30340;&#32456;&#31471;&#31995;&#32479;&#65292;&#21487;&#20197;&#19981;&#29992;&#21069;&#21488;&#24037;&#20316;&#20154;&#21592;&#24110;&#21161;&#19979;&#33258;&#21161;&#23436;&#25104;&#20837;&#20303;&#12290;&#39038;&#23458;&#21487;&#20197;&#25163;&#26426;&#19978;&#39044;&#23450;&#22312;&#33258;&#21161;&#26426;&#32456;&#31471;&#19978;&#20351;&#29992;&#36523;&#20221;&#35777;&#25110;&#32773;&#30005;&#35805;&#21495;&#30721;&#26597;&#35810;PMS&#31995;&#32479;&#19978;&#30340;&#35746;&#21333;&#65292;&#39038;&#23458;&#33258;&#24049;&#36873;&#25321;&#25151;&#38388;&#20197;&#21450;&#36890;&#36807;&#20844;&#23433;PSB&#31995;&#32479;&#20154;&#33080;&#26680;&#39564;(&#25110;&#32773;&#20351;&#29992;&#30005;&#23376;&#36523;&#20221;&#35777;)&#65292;&#24182;&#22312;&#25195;&#30721;&#25903;&#20184;&#25110;&#32773;&#20154;&#33080;&#25903;&#20184;&#25110;&#32773;&#25554;&#21345;&#25903;&#20184;&#23436;&#25104;&#21518;&#24471;&#21040;&#38376;&#21345;&#65292;&#39038;&#23458;&#25343;&#30528;&#38376;&#21345;&#23601;&#21487;&#20197;&#33258;&#34892;&#25214;&#21040;&#25151;&#38388;&#20837;&#20303;&#12290;&#39038;&#23458;&#20063;&#21487;&#20197;&#22312;&#26080;&#39044;&#23450;&#30340;&#24773;&#20917;&#19979;&#33258;&#34892;&#36827;&#34892;&#26597;&#35810;&#26159;&#21542;&#26377;&#21487;&#20303;&#25151;&#38388;&#36827;&#34892;&#36755;&#20837;&#20303;&#12290;&#36824;&#21487;&#20197;&#36827;&#34892;&#22242;&#20307;&#39044;&#23450;&#20837;&#20303;&#65292;&#26681;&#25454;&#25552;&#31034;&#27599;&#20010;&#25151;&#38388;&#20303;&#22810;&#23569;&#20154;&#65292;&#36890;&#36807;&#24403;&#22320;&#20844;&#23433;&#31995;&#32479;&#26680;&#39564;&#20837;&#20303;&#12290;&#39038;&#23458;&#22312;&#31532;&#20108;&#22825;&#21487;&#20197;&#33258;&#34892;&#25554;&#20837;&#38376;&#21345;&#36827;&#34892;&#36864;&#25151;&#21150;&#29702;&#20197;&#21450;&#25195;&#30721;&#24320;&#30005;&#23376;&#21457;&#31080;&#12290;&#25110;&#32773;&#25554;&#20837;&#38376;&#21345;&#26597;&#35810;&#20837;&#20303;&#25151;&#38388;&#20449;&#24687;&#36827;&#34892;&#32493;&#20303;&#27969;&#31243;&#12290;</p>
<p><strong>&#20010;&#20154;&#32844;&#36131;&#65306;</strong></p>
<ul>
<li><p>1.&#36127;&#36131;&#39033;&#30446;&#30340;&#25972;&#20307;&#26500;&#26550;&#35774;&#35745;&#20197;&#21450;&#26680;&#24515;&#27969;&#31243;&#24341;&#25806;&#30340;&#35774;&#35745;&#19982;&#23454;&#29616;&#65292;&#26041;&#20415;&#23454;&#29616;&#37202;&#24215;&#20837;&#20303;&#19994;&#21153;&#36923;&#36753;&#21160;&#24577;&#21464;&#25442;&#35843;&#25972;&#12290;&#20840;&#31243;&#21442;&#19982;&#65292;&#37325;&#28857;&#26550;&#26500;&#24320;&#21457;&#65292;&#35774;&#22791;&#25277;&#35937;&#25509;&#21475;&#21270;&#12290;</p></li>
<li><p>2.&#36127;&#36131;&#37096;&#20998;PMS&#31995;&#32479;&#23545;&#25509;(Restful&#39118;&#26684;&#30340;WebAPI&#23545;&#25509;&#65292;&#24322;&#27493;&#35831;&#27714;)&#65292;&#38376;&#38145;&#23545;&#25509;&#65292;&#20154;&#33080;&#25903;&#20184;&#20197;&#21450;&#25195;&#30721;&#25903;&#20184;&#21151;&#33021;&#23545;&#25509;&#21644;&#37096;&#20998;&#20844;&#23433;PSB&#31995;&#32479;&#30340;&#26680;&#39564;&#23545;&#25509;(&#20351;&#29992;ActiveMQ&#28040;&#24687;&#36890;&#30693;)&#12290;</p></li>
<li><p>3.&#36127;&#36131;&#39033;&#30446;&#20013;&#24341;&#20837;StyleCop.Analyzers&#36827;&#34892;&#20195;&#30721;&#25972;&#40784;&#35268;&#33539;&#65292;&#26816;&#26597;&#24320;&#21457;&#20154;&#21592;&#20195;&#30721;&#35268;&#33539;&#65292;&#20197;&#21450;&#25351;&#23548;&#32452;&#21592;&#36827;&#34892;&#35268;&#33539;&#24320;&#21457;&#12290;</p></li>
<li><p>4.&#36127;&#36131;&#39033;&#30446;&#20013;&#26085;&#24535;&#31995;&#32479;&#36873;&#22411;&#65292;&#20197;&#21450;ELK&#26085;&#24535;&#31995;&#32479;&#25645;&#24314;&#27979;&#35797;&#21644;&#37197;&#32622;&#19978;&#32447;&#65292;&#20197;&#21450;&#26412;&#22320;NLog&#30340;&#37197;&#32622;&#26041;&#27861;&#12290;</p></li>
<li><p>5.&#35299;&#20915;&#31532;&#19977;&#26041;&#38376;&#38145;SDK&#23849;&#28291;&#38382;&#39064;&#65292;&#20351;&#29992;&#21333;&#29420;&#36827;&#31243;&#21253;&#35013;&#36827;&#34892;&#65307;&#35299;&#20915;&#29305;&#27530;&#38376;&#38145;&#21327;&#35758;&#65292;Wireshark&#25235;&#21253;&#20998;&#26512;&#21644;&#26500;&#24314;&#21327;&#35758;&#12290;</p></li>
<li><p>6.&#25351;&#23548;&#21021;&#32423;&#24037;&#31243;&#24072;&#38598;&#25104;&#38376;&#38145;&#24320;&#21457;&#21644;&#20854;&#23427;&#24320;&#21457;&#20154;&#21592;&#20195;&#30721;&#36208;&#35835;&#12290;</p></li>
<li><p>7.&#22521;&#35757;&#24037;&#31243;&#20154;&#21592;&#20197;&#21450;&#29616;&#22330;&#25351;&#23548;&#33853;&#22320;&#23433;&#35013;&#65307;&#35299;&#20915;&#26576;&#27425;&#35774;&#22791;&#23433;&#35013;&#38382;&#39064;(&#33719;&#24471;&#24037;&#31243;&#22870;&#22870;&#21169;&#19968;&#20010;&#33590;&#26479;)&#12290;</p></li>
<li><p>8.&#39044;&#23450;&#20837;&#20303;&#21644;&#36864;&#25151;&#27969;&#31243;&#21644;&#24320;&#21457;&#65292;&#39318;&#39029;XAML&#27169;&#26495;&#21270;&#24320;&#21457;&#12290;</p></li>
<li><p>9.&#20248;&#21270;&#36719;&#20214;&#24615;&#33021;&#65292;&#35299;&#20915;&#25991;&#36716;&#35821;&#27169;&#22359;&#38271;&#26102;&#38388;&#36816;&#34892;&#20869;&#23384;&#20986;&#29616;&#24322;&#24120;&#30340;&#38382;&#39064;&#12290;</p></li>
</ul>
<p><strong>&#39033;&#30446;&#19994;&#32489;&#65306;</strong></p>
<ul>
<li><p>1.&#19982;1.0&#29256;&#26412;&#30340;WinForm&#33258;&#21161;&#26426;&#30456;&#27604;&#65292;&#20135;&#21697;&#26356;&#21487;&#38752;&#65292;&#22806;&#35266;UI&#26356;&#32654;&#35266;&#65292;&#23454;&#29616;&#20102;7*24&#23567;&#26102;&#30340;&#19981;&#38388;&#26029;&#36816;&#34892;&#12290;</p></li>
<li><p>2.&#24320;&#21457;&#30340;&#27969;&#31243;&#24341;&#25806;&#25552;&#39640;&#20102;25%&#20197;&#19978;&#30340;&#24320;&#21457;&#25928;&#29575;&#65292;&#21518;&#26399;&#21482;&#38656;&#35201;&#37197;&#32622;&#23601;&#21487;&#20197;&#23436;&#25104;&#19994;&#21153;&#35843;&#25972;&#12290;</p></li>
<li><p>3.&#19982;&#19968;&#20195;&#20135;&#21697;&#30456;&#27604;&#65292;&#19968;&#20195;&#33258;&#21161;&#26426;&#20135;&#21697;&#26085;&#22343;&#20351;&#29992;&#29575;100&#21333;&#19981;&#21040;&#36328;&#36234;&#21040;&#20108;&#20195;&#33258;&#21161;&#26426;&#20351;&#29992;&#29575;&#26085;&#22343;10000&#21333;&#20197;&#19978;&#65292;&#23436;&#20840;&#28120;&#27760;&#19968;&#20195;&#20135;&#21697;&#12290;</p></li>
<li><p>4.&#24050;&#32463;&#26381;&#21153;&#36229;&#36807;100&#19975;&#26053;&#23458;&#65307;&#31616;&#21270;&#27969;&#31243;&#65292;&#22823;&#22823;&#20943;&#23569;&#37202;&#24215;&#21069;&#21488;&#24037;&#20316;&#37327;&#65292;60&#20154;&#22242;&#38431;&#20837;&#20303;&#20165;&#38656;15&#20998;&#38047;&#65292;&#25928;&#29575;&#22823;&#24133;&#25552;&#21319;&#65307;&#21069;&#21488;&#19994;&#21153;24&#23567;&#26102;&#33258;&#21161;&#21150;&#29702;&#65292;&#23567;&#37202;&#24215;&#26080;&#20154;&#21270;&#31649;&#29702;&#65292;&#22823;&#37202;&#24215;&#31934;&#32454;&#21270;&#31649;&#29702;&#12290;</p></li>
<li><p>5.&#20010;&#20154;&#33719;&#24471;&#20844;&#21496;&#21019;&#26032;&#33635;&#35465;&#35777;&#20070;&#12290;</p></li>
</ul>
<p><strong>&#39033;&#30446;UI&#65306;</strong></p>
<div class="figure">
<img src="./&#37202;&#24215;&#20837;&#20303;&#33258;&#21161;&#26426;&#31995;&#32479;/&#33258;&#21161;&#26426;&#35774;&#35745;.png" alt="&#33258;&#21161;&#26426;V5&#65292;&#33267;&#20170;&#22823;&#37327;&#20351;&#29992;&#65292;5&#24180;&#26410;&#26356;&#25913;&#36807;&#26694;&#26550;&#12290;" />
<p class="caption">&#33258;&#21161;&#26426;V5&#65292;&#33267;&#20170;&#22823;&#37327;&#20351;&#29992;&#65292;5&#24180;&#26410;&#26356;&#25913;&#36807;&#26694;&#26550;&#12290;</p>
</div>
<div class="figure">
<img src="./&#37202;&#24215;&#20837;&#20303;&#33258;&#21161;&#26426;&#31995;&#32479;/&#33258;&#21161;&#37202;&#24215;&#20837;&#20303;&#33258;&#21161;&#26426;.jpg" alt="&#33258;&#21161;&#26426;&#21151;&#33021;&#39318;&#39029;" />
<p class="caption">&#33258;&#21161;&#26426;&#21151;&#33021;&#39318;&#39029;</p>
</div>
<div class="figure">
<img src="./&#37202;&#24215;&#20837;&#20303;&#33258;&#21161;&#26426;&#31995;&#32479;/&#36164;&#37329;800&#20803;.jpg" alt="&#33719;&#22870;&#35777;&#20070;" />
<p class="caption">&#33719;&#22870;&#35777;&#20070;</p>
</div>
<H2>
<ol start="2" style="list-style-type: decimal">
<li>&#27700;&#36136;&#22312;&#32447;&#30417;&#27979;&#31995;&#32479;
</H2></li>
</ol>
<p><strong>&#39033;&#30446;&#25551;&#36848;&#65306;</strong></p>
<p>&#8195;&#8195;&#27700;&#36136;&#22312;&#32447;&#30417;&#27979;&#31995;&#32479;&#20027;&#35201;&#29992;&#20110;&#29615;&#20445;&#37096;&#38376;&#65292;&#26159;&#19968;&#20010;&#20197;&#22312;&#32447;&#20998;&#26512;&#20202;&#34920;&#21644;&#23454;&#39564;&#23460;&#30740;&#31350;&#38656;&#27714;&#20026;&#26381;&#21153;&#30446;&#26631;&#65292;&#23545;&#21306;&#22495;&#20869;&#30340;&#27827;&#27969;&#65292;&#27700;&#24211;&#65292;&#25490;&#27700;&#31995;&#32479;&#65292;&#28246;&#27850;&#31561;&#27700;&#31995;&#36827;&#34892;&#29615;&#22659;&#30417;&#27979;&#36827;&#34892;&#23454;&#26102;&#30417;&#27979;&#30340;&#19968;&#22871;&#31995;&#32479;&#12290;&#20027;&#35201;&#27979;&#37327;&#27700;&#36136;pH,&#30005;&#23548;&#29575;,&#28342;&#35299;&#27687;,&#27978;&#24230;,&#28201;&#24230;&#31561;&#20116;&#21442;&#25968;&#20197;&#21450;&#26377;&#27602;&#27745;&#26579;&#20803;&#32032;&#21644;&#37325;&#37329;&#23646;&#20803;&#32032;(&#21253;&#25324;&#24635;&#30967;&#65292;&#24635;&#27694;&#65292;&#27688;&#27694;&#65292;&#39640;&#38192;&#37240;&#30416;&#31561;100&#22810;&#31181;&#27745;&#26579;&#20803;&#32032;)&#65292;&#36816;&#29992;&#33258;&#21160;&#25511;&#21046;&#25216;&#26415;&#65292;&#32452;&#25104;&#19968;&#20010;&#20174;&#21462;&#26679;&#65292;&#39044;&#22788;&#29702;&#65292;&#20998;&#26512;&#21040;&#25968;&#25454;&#22788;&#29702;&#21450;&#36828;&#31243;&#20256;&#36755;&#25968;&#25454;&#21450;&#25253;&#35686;&#30340;&#23436;&#25972;&#31995;&#32479;&#12290;&#35813;&#39033;&#30446;&#20027;&#35201;&#26159;&#38024;&#23545;&#21407;&#26469;&#26087;&#29256;&#26412;UI&#36827;&#34892;&#37325;&#26032;&#35774;&#35745;&#24320;&#21457;&#20197;&#21450;&#38598;&#25104;&#23433;&#38450;&#25668;&#20687;&#65292;&#38376;&#31105;&#31995;&#32479;&#65292;&#20248;&#21270;&#25511;&#21046;&#36923;&#36753;&#21644;&#38598;&#25104;&#26032;&#35774;&#22791;&#21644;&#36890;&#20449;&#21327;&#35758;&#30340;&#39033;&#30446;&#12290;</p>
<p><strong>&#20010;&#20154;&#32844;&#36131;&#65306;</strong></p>
<ul>
<li>1.&#39033;&#30446;&#32463;&#29702;&#65292;&#39033;&#30446;&#25353;&#29031;IPD&#24320;&#21457;&#27969;&#31243;&#36827;&#34892;&#21508;&#20010;&#38454;&#27573;&#30340;&#39033;&#30446;&#20070;&#32534;&#20889;&#21450;&#32452;&#32455;&#39033;&#30446;&#21508;&#20010;&#29615;&#33410;&#35780;&#23457;&#65307;</li>
<li>2.&#36127;&#36131;&#22806;&#37096;UI&#35774;&#35745;&#24072;&#30340;&#35774;&#35745;&#19982;&#20869;&#37096;&#35780;&#23457;&#24037;&#20316;&#65307;</li>
<li>3.UI&#26032;&#26694;&#26550;&#30340;&#24320;&#21457;&#65307;</li>
<li>4.&#38598;&#25104;&#28023;&#24247;&#25668;&#20687;&#22836;&#30417;&#25511;&#31995;&#32479;&#65292;&#36827;&#34892;&#24033;&#26816;&#19982;&#25235;&#25293;&#24405;&#20687;&#23433;&#20840;&#24322;&#24120;&#20107;&#20214;&#24182;&#36890;&#30693;&#24179;&#21488;&#65307;</li>
<li>5.&#38598;&#25104;&#21047;&#21345;&#38376;&#31105;&#31995;&#32479;&#65292;&#23545;&#38750;&#27861;&#36827;&#20837;&#36827;&#34892;&#26631;&#24535;&#65292;&#35302;&#21457;&#28023;&#24247;&#30417;&#27979;&#31995;&#32479;&#25293;&#29031;&#20445;&#23384;&#65307;</li>
<li>6.&#21327;&#35843;&#27979;&#35797;&#20154;&#21592;&#38598;&#25104;&#33258;&#20135;&#20202;&#22120;&#30340;&#27979;&#35797;&#24037;&#20316;&#65307;</li>
<li>7.&#21327;&#35843;&#24320;&#21457;&#20154;&#21592;&#24320;&#21457;&#38598;&#25104;&#20854;&#23427;&#35774;&#22791;&#65307;</li>
<li>8.&#21327;&#35843;&#30005;&#25511;&#35774;&#35745;&#20154;&#21592;&#36827;&#34892;&#20135;&#21697;&#25511;&#21046;&#23545;&#25509;&#65307;</li>
<li>9.&#25351;&#23548;&#20854;&#23427;&#24320;&#21457;&#20154;&#21592;&#24320;&#21457;&#20351;&#29992;&#33258;&#23450;&#20041;&#25511;&#20214;&#21644;&#20854;&#23427;&#35774;&#22791;&#38598;&#25104;&#24320;&#21457;&#12290;</li>
</ul>
<p><strong>&#39033;&#30446;&#19994;&#32489;&#65306;</strong></p>
<p>&#8195;&#8195;&#19978;&#20301;&#26426;&#36719;&#20214;&#36827;&#34892;UI&#26032;&#29256;&#26412;&#30340;&#20840;&#38754;&#21319;&#32423;&#65292;&#38598;&#25104;&#28023;&#24247;&#35270;&#39057;&#23433;&#38450;&#30417;&#25511;&#31995;&#32479;&#65292;&#38598;&#25104;&#38376;&#31105;&#31995;&#32479;&#65292;&#20316;&#20026;&#26032;&#19968;&#20195;&#20135;&#21697;&#38144;&#21806;&#65292;&#20248;&#21270;&#37096;&#20998;&#32452;&#20214;&#24179;&#21488;&#24615;&#33021;&#65292;&#20197;&#21450;&#25972;&#29702;&#25104;&#27169;&#22359;&#22359;&#26041;&#20415;&#20854;&#23427;&#39033;&#30446;&#19978;&#20351;&#29992;&#12290;</p>
<p><strong>&#39033;&#30446;UI&#65306;</strong></p>
<div class="figure">
<img src="./&#27700;&#36136;&#30417;&#27979;&#31995;&#32479;/&#32452;&#24577;&#31995;&#32479;UI2.jpg" alt="&#26032;&#29256;&#27700;&#36136;&#30417;&#27979;&#31995;&#32479;UI" />
<p class="caption">&#26032;&#29256;&#27700;&#36136;&#30417;&#27979;&#31995;&#32479;UI</p>
</div>
<div class="figure">
<img src="./&#27700;&#36136;&#30417;&#27979;&#31995;&#32479;/&#32452;&#24577;&#31995;&#32479;UI7.jpg" alt="&#32452;&#24577;UI" />
<p class="caption">&#32452;&#24577;UI</p>
</div>
<div class="figure">
<img src="./&#27700;&#36136;&#30417;&#27979;&#31995;&#32479;/&#23567;&#22411;&#31449;1.png" alt="&#22235;&#24179;&#26041;&#23567;&#22411;&#31449;" />
<p class="caption">&#22235;&#24179;&#26041;&#23567;&#22411;&#31449;</p>
</div>
<H2>
<ol start="3" style="list-style-type: decimal">
<li>&#38480;&#36895;&#22120;&#27979;&#35797;&#21450;&#25171;&#21360;&#35013;&#31665;&#31995;&#32479;
</H2></li>
</ol>
<p><strong>&#39033;&#30446;&#25551;&#36848;&#65306;</strong></p>
<p>&#8195;&#8195;&#35813;&#39033;&#30446;&#20027;&#35201;&#26159;&#38024;&#23545;&#20844;&#21496;&#38480;&#36895;&#22120;&#29983;&#20135;&#32447;&#36827;&#34892;&#31616;&#21333;MES&#31995;&#32479;&#36827;&#34892;&#21021;&#27493;&#25913;&#36896;&#30340;&#65292;&#20351;&#24471;&#38480;&#36895;&#22120;&#29983;&#20135;&#32447;&#21322;&#33258;&#21160;&#21270;&#21644;&#25968;&#23383;&#21270;&#12290;&#38480;&#36895;&#22120;&#35774;&#22791;&#29983;&#20135;&#19978;&#32447;&#32452;&#35013;&#21322;&#25104;&#21697;&#21518;&#25195;&#30721;&#33719;&#21462;MES&#31995;&#32479;&#20013;&#35774;&#31435;&#30340;&#22269;&#23478;&#34892;&#19994;&#26631;&#20934;&#25968;&#25454;&#36827;&#34892;&#36895;&#24230;&#27979;&#35797;&#21644;&#25289;&#25300;&#21147;&#27979;&#35797;&#65292;&#26681;&#25454;&#27979;&#35797;&#25968;&#25454;&#21160;&#24577;&#35843;&#25972;&#38480;&#36895;&#22120;&#35774;&#22791;&#24615;&#33021;&#25351;&#26631;&#21040;&#31526;&#21512;&#22269;&#23478;&#34892;&#19994;&#26631;&#20934;&#65292;&#35843;&#35797;&#23436;&#25104;&#21518;&#20445;&#23384;&#25972;&#20010;&#38480;&#36895;&#22120;&#35774;&#22791;&#30340;&#27979;&#35797;&#25968;&#25454;&#21040;MES&#31995;&#32479;&#21644;ERP&#30456;&#20851;&#31995;&#32479;&#20013;&#65292;&#22312;&#19979;&#27493;&#24037;&#24207;&#20013;&#35843;&#29992;&#35843;&#35797;&#27979;&#35797;&#30340;&#26377;&#25928;&#25968;&#25454;&#25171;&#21360;&#38125;&#29260;&#65292;&#25171;&#21360;&#27979;&#35797;&#25253;&#21517;&#65292;&#20197;&#21450;&#25171;&#21360;&#26465;&#30721;&#20379;&#21508;&#20010;&#29983;&#20135;&#30456;&#20851;&#20154;&#21592;&#26597;&#35810;&#36861;&#28335;&#25968;&#25454;&#65292;&#26368;&#21518;&#22312;&#27969;&#27700;&#32447;&#26411;&#31471;&#65292;&#31995;&#32479;&#21457;&#36865;&#25351;&#20196;&#36890;&#30693;&#20179;&#20648;&#26426;&#22120;&#29226;&#32467;&#26500;&#25235;&#21462;&#35774;&#22791;&#65292;&#33719;&#21462;&#35774;&#22791;&#20998;&#37197;&#20179;&#24211;&#20301;&#32622;&#65292;&#33258;&#21160;&#25226;&#35774;&#22791;&#23384;&#20648;&#22312;&#23545;&#24212;&#36135;&#26550;&#19978;&#65292;&#38656;&#35201;&#20986;&#36135;&#26102;&#22312;ERP&#31995;&#32479;&#20013;&#21457;&#20986;&#20986;&#24211;&#25351;&#20196;&#65292;&#26426;&#22120;&#29226;&#33258;&#21160;&#20381;&#24207;&#25552;&#20986;&#35774;&#22791;&#21040;&#25171;&#21253;&#35013;&#31665;&#27969;&#27700;&#32447;&#12290;&#30446;&#21069;&#31995;&#32479;&#24050;&#32463;&#27491;&#24120;&#36816;&#34892;10&#22810;&#24180;&#65292;&#36824;&#22312;&#20316;&#20026;&#20135;&#32447;&#20027;&#35201;&#26680;&#24515;&#27491;&#24120;&#20351;&#29992;&#12290;</p>
<p><strong>&#39033;&#30446;&#32844;&#36131;&#65306;</strong></p>
<ul>
<li>1.&#36127;&#36131;&#19982;&#33258;&#21160;&#21270;&#24037;&#31243;&#24072;&#21046;&#23450;PLC&#25511;&#21046;&#21327;&#35758;&#65307;</li>
<li>2.&#36127;&#36131;&#29983;&#20135;&#32447;&#30340;&#27979;&#35797;&#25968;&#25454;&#37319;&#38598;&#36719;&#20214;&#24320;&#21457;&#65307;</li>
<li>3.&#31665;&#22806;&#26631;&#35782;&#25171;&#21360;&#36719;&#20214;&#30340;&#24320;&#21457;&#65292;&#20179;&#20648;&#20998;&#37197;&#30340;&#31639;&#27861;&#24320;&#21457;&#21450;&#25511;&#21046;&#30340;&#24320;&#21457;&#12290;</li>
<li>4.&#35299;&#20915;&#21333;&#27425;PLC&#26410;&#19978;&#20256;&#25968;&#25454;&#25110;&#32773;&#32593;&#32476;&#24322;&#24120;&#20445;&#23384;&#27979;&#35797;&#25968;&#25454;&#24322;&#24120;&#30340;&#20877;&#27425;&#20445;&#23384;&#12290;</li>
</ul>
<p><strong>&#39033;&#30446;&#19994;&#32489;&#65306;</strong></p>
<ul>
<li>1.&#21407;&#26469;&#29983;&#20135;&#32447;&#20135;&#37327;80&#21488;/&#20154;&#22825;&#21464;&#25104;120&#21488;/&#20154;&#22825;&#65307;</li>
<li>2.&#27979;&#37327;&#25968;&#25454;&#21487;&#36861;&#28335;&#65292;&#20135;&#21697;&#20986;&#21378;&#36136;&#37327;&#30001;&#21407;&#26469;&#30340;98%&#21464;&#25104;99.99%&#65307;</li>
<li>3.&#24037;&#21378;&#20449;&#24687;&#21270;&#27700;&#24179;&#20174;0&#21040;1&#65292;&#23454;&#29616;&#20135;&#21697;&#20449;&#24687;&#21487;&#36861;&#28335;&#21270;&#65307;</li>
<li>4.&#26631;&#31614;&#31995;&#32479;&#26041;&#20415;&#20179;&#24211;&#33258;&#21160;&#31649;&#29702;&#65292;&#20449;&#24687;&#21270;&#31649;&#29702;&#65307;</li>
<li>5.&#30446;&#21069;&#35813;&#27979;&#35797;&#33021;&#36719;&#20214;&#24050;&#32463;&#31283;&#23450;&#36816;&#34892;&#36798;10&#24180;&#24182;&#25345;&#32493;&#20026;&#20844;&#21496;&#29983;&#20135;&#26381;&#21153;&#65307;</li>
<li>6.&#33719;&#24471;&#26085;&#31435;&#65292;&#36890;&#21147;&#30005;&#26799;&#31561;&#20844;&#21496;&#30340;&#35748;&#21487;&#21644;&#39069;&#22806;&#35746;&#21333;&#12290;</li>
</ul>
<p><strong>&#39033;&#30446;UI&#65306;</strong></p>
<div class="figure">
<img src="./&#38480;&#36895;&#22120;&#27979;&#35797;&#31995;&#32479;/SpeedGovernorV1.jpg" alt="&#38480;&#36895;&#22120;&#27979;&#35797;&#31532;&#19968;&#29256;&#26412;,&#36830;&#32493;&#36816;&#34892;10&#22810;&#24180;&#33267;&#20170;&#36824;&#22312;&#20351;&#29992;&#12290;" />
<p class="caption">&#38480;&#36895;&#22120;&#27979;&#35797;&#31532;&#19968;&#29256;&#26412;,&#36830;&#32493;&#36816;&#34892;10&#22810;&#24180;&#33267;&#20170;&#36824;&#22312;&#20351;&#29992;&#12290;</p>
</div>
<div class="figure">
<img src="./&#38480;&#36895;&#22120;&#27979;&#35797;&#31995;&#32479;/&#21452;&#24231;&#38480;&#36895;&#22120;&#27979;&#35797;&#31995;&#32479;.png" alt="&#38480;&#36895;&#22120;&#27979;&#35797;&#26032;&#29256;&#26412;,&#36830;&#32493;&#36816;&#34892;5&#24180;&#24182;&#24191;&#27867;&#20351;&#29992;" />
<p class="caption">&#38480;&#36895;&#22120;&#27979;&#35797;&#26032;&#29256;&#26412;,&#36830;&#32493;&#36816;&#34892;5&#24180;&#24182;&#24191;&#27867;&#20351;&#29992;</p>
</div>
<div class="figure">
<img src="./&#38480;&#36895;&#22120;&#27979;&#35797;&#31995;&#32479;/deforce.png" alt="&#25289;&#25300;&#21147;&#21151;&#33021;&#27979;&#35797;" />
<p class="caption">&#25289;&#25300;&#21147;&#21151;&#33021;&#27979;&#35797;</p>
</div>
<H2>
<ol start="4" style="list-style-type: decimal">
<li>&#27668;&#21619;&#30005;&#24433;&#33050;&#26412;&#32534;&#36753;&#22120;
</H2></li>
</ol>
<p><strong>&#39033;&#30446;&#25551;&#36848;&#65306;</strong></p>
<p>&#8195;&#8195;&#26412;&#31995;&#32479;&#19987;&#38376;&#20026;&#20102;&#20844;&#21496;&#27668;&#21619;&#30005;&#24433;&#20135;&#21697;&#25152;&#20570;&#30340;&#33050;&#26412;&#32534;&#36753;&#22120;&#65292;&#20027;&#35201;&#36890;&#36807;&#32467;&#21512;&#33756;&#21333;&#27169;&#22359;&#25511;&#20214;&#65292;&#27668;&#21619;&#24211;&#25511;&#21046;&#65292;&#35270;&#39057;&#25773;&#25918;&#65292;&#27668;&#21619;&#33050;&#26412;&#32534;&#36753;&#25511;&#20214;&#65292;&#25552;&#20379;&#21487;&#35270;&#21270;&#32534;&#36753;&#22120;&#65292;&#22312;&#25773;&#25918;&#35270;&#39057;&#26102;&#65292;&#25302;&#21160;&#33050;&#26412;&#21040;&#26102;&#38388;&#36724;&#19978;&#65292;&#35302;&#21457;&#24213;&#23618;&#38598;&#25104;&#30340;&#35774;&#22791;&#33258;&#21160;&#25773;&#25918;&#23545;&#24212;&#27668;&#21619;&#65292;&#32534;&#36753;&#23436;&#25104;&#21518;&#65292;&#23548;&#20986;&#35270;&#39057;&#19982;&#33050;&#26412;&#25552;&#20379;&#32473;&#27668;&#21619;&#25773;&#25918;&#22120;&#25773;&#25918;&#65292;&#24182;&#21487;&#20197;&#23454;&#26102;&#23545;&#25668;&#20687;&#22836;&#37319;&#38598;&#30340;&#35270;&#39057;&#36827;&#34892;&#22270;&#29255;&#35782;&#21035;&#65292;&#35782;&#21035;&#21040;&#19982;&#27668;&#21619;&#24211;&#30456;&#20851;&#30340;&#27668;&#21619;&#21487;&#20197;&#33258;&#21160;&#25773;&#25918;&#65292;&#30446;&#21069;&#21487;&#20351;&#29992;&#26426;&#22120;&#29399;&#25110;&#32773;&#26080;&#20154;&#26426;&#37319;&#38598;&#21040;&#36828;&#22788;&#30340;&#33457;&#33609;&#26641;&#26408;&#31561;&#35270;&#39057;&#21644;&#35782;&#21035;&#25773;&#25918;&#27668;&#21619;&#12290;</p>
<p><strong>&#39033;&#30446;&#32844;&#36131;&#65306;</strong></p>
<ul>
<li><p>1.&#36127;&#36131;&#26694;&#26550;&#32467;&#26500;&#35774;&#35745;&#65292;UI&#32452;&#20214;&#35774;&#35745;&#24320;&#21457;&#65292;&#24213;&#23618;&#35774;&#22791;&#25511;&#21046;&#27169;&#22359;&#30340;&#26550;&#26500;&#24320;&#21457;&#12290;</p></li>
<li><p>2.&#36127;&#36131;&#36890;&#20449;&#21327;&#35758;&#30340;&#21046;&#23450;&#65292;&#21327;&#21161;&#35774;&#22791;&#32452;&#35013;&#20154;&#21592;&#27979;&#35797;&#30828;&#20214;&#24615;&#33021;&#12290;</p></li>
<li><p>3.&#36127;&#36131;&#21518;&#26399;&#32467;&#21512;&#25195;&#30721;&#20184;&#36153;&#20351;&#29992;&#25509;&#21475;&#21644;&#25668;&#20687;&#22836;&#37319;&#38598;&#35270;&#39057;&#35782;&#21035;&#21151;&#33021;&#30340;&#38598;&#25104;&#12290;</p></li>
</ul>
<p><strong>&#39033;&#30446;&#19994;&#32489;&#65306;</strong></p>
<p>&#8195;&#8195;&#20316;&#20026;&#20844;&#21496;&#30340;&#26368;&#24120;&#29992;&#30340;&#24037;&#20855;&#36719;&#20214;&#21644;&#24213;&#23618;&#26550;&#26500;&#65292;&#20026;&#20854;&#23427;&#39033;&#30446;&#33410;&#30465;&#24320;&#21457;&#26102;&#38388;&#21644;&#27169;&#22359;&#30340;&#25903;&#25345;&#12290;</p>
<p><strong>&#39033;&#30446;UI&#65306;</strong></p>
<div class="figure">
<img src="./&#27668;&#21619;&#32534;&#36753;&#22120;/&#27668;&#21619;&#32534;&#36753;&#22120;1.jpg" alt="WPF&#24320;&#21457;&#30340;&#27668;&#21619;&#30005;&#24433;&#33050;&#26412;&#32534;&#36753;&#22120;" />
<p class="caption">WPF&#24320;&#21457;&#30340;&#27668;&#21619;&#30005;&#24433;&#33050;&#26412;&#32534;&#36753;&#22120;</p>
</div>
<div class="figure">
<img src="./&#27668;&#21619;&#32534;&#36753;&#22120;/&#27668;&#21619;&#32534;&#36753;&#22120;2.jpg" alt="&#27668;&#21619;&#30005;&#24433;&#25773;&#25918;" />
<p class="caption">&#27668;&#21619;&#30005;&#24433;&#25773;&#25918;</p>
</div>
<div class="figure">
<img src="./&#27668;&#21619;&#32534;&#36753;&#22120;/&#35270;&#39057;&#33457;&#33609;&#35782;&#21035;.png" alt="&#23454;&#26102;&#35270;&#39057;&#27668;&#21619;&#35782;&#21035;" />
<p class="caption">&#23454;&#26102;&#35270;&#39057;&#27668;&#21619;&#35782;&#21035;</p>
</div>
<div class="figure">
<img src="./&#27668;&#21619;&#32534;&#36753;&#22120;/wearscent.png" alt="&#27668;&#21619;&#30005;&#24433;&#35774;&#22791;" />
<p class="caption">&#27668;&#21619;&#30005;&#24433;&#35774;&#22791;</p>
</div>
<H2>
<ol start="5" style="list-style-type: decimal">
<li>&#27668;&#21619;&#30005;&#24433;&#25773;&#25918;&#22120;
</H2></li>
</ol>
<p><strong>&#39033;&#30446;&#25551;&#36848;&#65306;</strong></p>
<p>&#8195;&#8195;&#26412;&#31995;&#32479;&#19987;&#38376;&#25773;&#25918;&#27668;&#21619;&#30005;&#24433;&#32780;&#24320;&#21457;&#30340;&#27668;&#21619;&#30005;&#24433;&#25773;&#25918;&#22120;&#65292;&#36866;&#29992;&#20110;&#21508;&#22823;&#24433;&#22478;&#25773;&#25918;&#27668;&#21619;&#30005;&#24433;&#65292;&#22686;&#21152;&#30005;&#24433;&#32500;&#24230;&#20174;3D&#21040;4D&#30340;&#36807;&#31243;&#12290;</p>
<p><strong>&#39033;&#30446;&#32844;&#36131;&#65306;</strong></p>
<ul>
<li><p>1.&#36127;&#36131;&#36719;&#20214;&#30340;&#20840;&#37096;&#21151;&#33021;&#24320;&#21457;&#65292;&#35270;&#39057;&#27969;&#25773;&#25918;&#22120;&#12290;</p></li>
<li><p>2.&#36127;&#36131;&#27668;&#21619;&#30005;&#24433;&#26032;&#29256;&#26412;&#25511;&#21046;&#22120;&#30340;&#38598;&#25104;&#12290;</p></li>
<li><p>3.VLC&#27969;&#23186;&#20307;&#26381;&#21153;&#25645;&#24314;&#12290;</p></li>
</ul>
<p><strong>&#39033;&#30446;&#19994;&#32489;&#65306;</strong></p>
<p>&#8195;&#8195;&#20316;&#20026;&#20844;&#21496;&#30340;&#26368;&#26680;&#24515;&#20135;&#21697;&#30340;&#36719;&#20214;&#37096;&#20998;&#26041;&#20415;&#32467;&#21512;&#30828;&#20214;&#35774;&#22791;&#25104;&#22871;&#38144;&#21806;&#25110;&#32773;&#31199;&#20511;&#30340;&#36719;&#35774;&#26045;&#12290;</p>
<p><strong>&#39033;&#30446;UI&#65306;</strong></p>
<div class="figure">
<img src="./&#27668;&#21619;&#32534;&#36753;&#25773;&#25918;&#22120;/&#27668;&#21619;&#25773;&#25918;&#22120;01.png" alt="WINFORM&#29256;&#26412;&#27668;&#21619;&#25773;&#25918;&#22120;" />
<p class="caption">WINFORM&#29256;&#26412;&#27668;&#21619;&#25773;&#25918;&#22120;</p>
</div>
<div class="figure">
<img src="./&#27668;&#21619;&#32534;&#36753;&#25773;&#25918;&#22120;/&#27668;&#21619;&#25773;&#25918;&#22120;1.jpg" alt="WPF&#29256;&#26412;&#27668;&#21619;&#25773;&#25918;&#22120;" />
<p class="caption">WPF&#29256;&#26412;&#27668;&#21619;&#25773;&#25918;&#22120;</p>
</div>
<div class="figure">
<img src="./&#27668;&#21619;&#32534;&#36753;&#25773;&#25918;&#22120;/&#27668;&#21619;&#25773;&#25918;&#22120;3.jpg" alt="WPF&#29256;&#26412;&#27668;&#21619;&#25773;&#25918;&#22120;" />
<p class="caption">WPF&#29256;&#26412;&#27668;&#21619;&#25773;&#25918;&#22120;</p>
</div>
<H2>
<ol start="6" style="list-style-type: decimal">
<li>&#31185;&#21957;&#20202;
</H2></li>
</ol>
<p><strong>&#39033;&#30446;&#25551;&#36848;&#65306;</strong></p>
<p>&#8195;&#8195;&#26412;&#31995;&#32479;&#19987;&#38376;&#20026;&#20013;&#31185;&#38498;&#23450;&#21046;&#30340;&#21957;&#35273;&#26816;&#27979;&#32456;&#31471;&#35774;&#22791;&#65292;&#26681;&#25454;&#21957;&#35273;&#21151;&#33021;&#35780;&#20272;&#26631;&#20934;&#65292;&#30149;&#20154;&#22312;&#27979;&#35797;&#31995;&#32479;&#20013;&#23436;&#25104;&#21957;&#35273;&#39064;&#30446;&#30340;&#27979;&#35797;&#21644;&#29983;&#27963;&#20064;&#24815;&#30340;&#30331;&#35760;&#65292;&#30001;&#21307;&#29983;&#26681;&#25454;&#29992;&#25143;&#27979;&#35797;&#32467;&#26524;&#21644;&#30149;&#20154;&#29983;&#27963;&#20064;&#24815;&#35780;&#20272;&#29992;&#25143;&#30340;&#21957;&#35273;&#33021;&#21147;&#65292;&#21307;&#29983;&#20197;&#27492;&#20316;&#20026;&#27835;&#30103;&#20381;&#25454;&#36827;&#34892;&#21957;&#35273;&#38556;&#30861;&#36827;&#34892;&#21307;&#30103;&#65292;&#27492;&#27979;&#35797;&#32467;&#26524;&#21487;&#20197;&#20316;&#20026;&#21957;&#35273;&#26680;&#26597;&#30340;&#37325;&#35201;&#21442;&#32771;&#20381;&#25454;&#12290;</p>
<p><strong>&#39033;&#30446;&#32844;&#36131;&#65306;</strong></p>
<ul>
<li><p>1.&#36127;&#36131;&#36719;&#20214;&#30340;&#20840;&#37096;&#21151;&#33021;&#24320;&#21457;&#12290;</p></li>
<li><p>2.&#36127;&#36131;&#19982;&#20013;&#31185;&#38498;&#21151;&#33021;&#38656;&#27714;&#30340;&#23545;&#25509;&#12290;</p></li>
<li><p>3.&#36127;&#36131;&#19982;&#21307;&#38498;&#30340;HIS&#31995;&#32479;&#23545;&#25509;&#19978;&#20256;&#27979;&#35797;&#32467;&#26524;&#65292;&#20351;&#29992;RestFull&#39118;&#26684;&#30340;WebAPI&#25509;&#21475;&#65292;&#21152;&#23494;&#26657;&#39564;&#19978;&#20256;&#25968;&#25454;&#12290;</p></li>
<li><p>4.&#24341;&#29992;&#21644;&#33258;&#23450;&#20041;&#35774;&#35745;&#27493;&#39588;&#32452;&#20214;&#65292;&#22836;&#37096;&#32452;&#20214;&#65292;&#25171;&#21360;&#25253;&#21578;&#32452;&#20214;&#12290;</p></li>
</ul>
<p><strong>&#39033;&#30446;&#19994;&#32489;&#65306;</strong></p>
<p>&#8195;&#8195;&#20316;&#20026;&#20844;&#21496;&#31532;&#19968;&#27425;&#19982;&#20013;&#31185;&#38498;&#21512;&#20316;&#30340;&#20135;&#21697;&#65292;&#20063;&#26159;&#31532;&#19968;&#27425;&#36827;&#20837;&#21307;&#30103;&#30456;&#20851;&#30340;&#39046;&#22495;&#26377;&#24456;&#22823;&#30340;&#24847;&#20041;&#65292;&#30446;&#21069;&#24050;&#32463;&#26377;&#37096;&#20998;&#20135;&#21697;&#24050;&#32463;&#20351;&#29992;&#20013;&#65292;&#20063;&#26159;&#20316;&#20026;&#20013;&#31185;&#38498;&#30740;&#31350;&#30340;&#36741;&#21161;&#22120;&#26448;&#65292;&#23545;&#20110;&#20010;&#20154;&#26469;&#35828;&#26159;&#21307;&#30103;&#39046;&#22495;&#30340;&#33258;&#21161;&#26426;&#24320;&#21457;&#12290;</p>
<p><strong>&#39033;&#30446;UI&#65306;</strong></p>
<div class="figure">
<img src="./&#31185;&#21957;&#20202;/home.png" alt="&#35774;&#22791;&#25972;&#26426;&#35774;&#35745;" />
<p class="caption">&#35774;&#22791;&#25972;&#26426;&#35774;&#35745;</p>
</div>
<div class="figure">
<img src="./&#31185;&#21957;&#20202;/home1.png" alt="&#27979;&#35797;&#21407;&#29702;&#34920;" />
<p class="caption">&#27979;&#35797;&#21407;&#29702;&#34920;</p>
</div>
<div class="figure">
<img src="./&#31185;&#21957;&#20202;/&#31185;&#21957;&#20202;1.jpg" alt="&#21151;&#33021;&#39318;&#39029;" />
<p class="caption">&#21151;&#33021;&#39318;&#39029;</p>
</div>
<div class="figure">
<img src="./&#31185;&#21957;&#20202;/&#31185;&#21957;&#20202;2.jpg" alt="&#30331;&#24405;&#30028;&#38754;" />
<p class="caption">&#30331;&#24405;&#30028;&#38754;</p>
</div>
<div class="figure">
<img src="./&#31185;&#21957;&#20202;/&#31185;&#21957;&#20202;3.jpg" alt="&#39318;&#39029;&#39064;&#22411;&#36873;&#25321;" />
<p class="caption">&#39318;&#39029;&#39064;&#22411;&#36873;&#25321;</p>
</div>
<div class="figure">
<img src="./&#31185;&#21957;&#20202;/&#31185;&#21957;&#20202;4.jpg" alt="&#20010;&#20154;&#36523;&#20221;&#20449;&#24687;&#22635;&#20889;" />
<p class="caption">&#20010;&#20154;&#36523;&#20221;&#20449;&#24687;&#22635;&#20889;</p>
</div>
<div class="figure">
<img src="./&#31185;&#21957;&#20202;/&#31185;&#21957;&#20202;7.jpg" alt="&#36873;&#25321;&#39064;&#27979;&#35797;" />
<p class="caption">&#36873;&#25321;&#39064;&#27979;&#35797;</p>
</div>
<div class="figure">
<img src="./&#31185;&#21957;&#20202;/&#31185;&#21957;&#20202;8.jpg" alt="&#21560;&#28895;&#23545;&#21957;&#35273;&#24433;&#21709;" />
<p class="caption">&#21560;&#28895;&#23545;&#21957;&#35273;&#24433;&#21709;</p>
</div>
<div class="figure">
<img src="./&#31185;&#21957;&#20202;/&#31185;&#21957;&#20202;9.jpg" alt="&#20010;&#20154;&#40763;&#23376;&#30456;&#20851;&#20449;&#24687;" />
<p class="caption">&#20010;&#20154;&#40763;&#23376;&#30456;&#20851;&#20449;&#24687;</p>
</div>
<div class="figure">
<img src="./&#31185;&#21957;&#20202;/&#31185;&#21957;&#20202;10.jpg" alt="&#27491;&#24335;&#27979;&#35797;&#32467;&#26524;&#25171;&#21360;&#39029;" />
<p class="caption">&#27491;&#24335;&#27979;&#35797;&#32467;&#26524;&#25171;&#21360;&#39029;</p>
</div>
<div class="figure">
<img src="./&#31185;&#21957;&#20202;/Result1.png" alt="&#32467;&#26524;&#39029;&#21478;&#31867;&#34920;&#29616;" />
<p class="caption">&#32467;&#26524;&#39029;&#21478;&#31867;&#34920;&#29616;</p>
</div>
<H2>
<ol start="6" style="list-style-type: decimal">
<li>&#31185;&#21957;&#20202;&#23089;&#20048;&#29256;--&#27668;&#21619;&#28216;&#25103;&#26426;
</H2></li>
</ol>
<p><strong>&#39033;&#30446;&#25551;&#36848;&#65306;</strong></p>
<p>&#8195;&#8195;&#26412;&#31995;&#32479;&#26159;&#26681;&#25454;&#31185;&#21957;&#20202;&#25913;&#29256;&#32780;&#25104;&#65292;&#26088;&#22312;&#20026;&#22823;&#20247;&#31616;&#21333;&#30340;&#20102;&#35299;&#19979;&#33258;&#24049;&#21957;&#35273;&#33021;&#21147;&#65292;&#20316;&#20026;&#21957;&#35273;&#33021;&#21147;&#30340;&#21442;&#32771;&#65292;&#20027;&#35201;&#20316;&#20026;&#23089;&#20048;&#22120;&#26448;&#20043;&#29992;&#12290;&#31995;&#32479;&#37319;&#29992;WPF&#30340;MVVM&#27169;&#24335;&#65292;&#37319;&#29992;RestFull&#39118;&#26684;&#30340;WebAPI&#25509;&#21475;&#65292;&#20256;&#36755;JSON&#26684;&#24335;&#25968;&#25454;&#12290;&#33258;&#23450;&#20041;&#35774;&#35745;&#27493;&#39588;&#32452;&#20214;&#65292;&#22836;&#37096;&#32452;&#20214;&#32467;&#21512;&#20570;&#39064;&#36923;&#36753;&#19968;&#27493;&#27493;&#25353;&#30528;&#27969;&#31243;&#27493;&#39588;&#36208;&#65292;&#23436;&#25104;&#26368;&#32456;&#25253;&#21578;&#65292;&#26174;&#31034;&#25253;&#21578;&#20108;&#32500;&#30721;&#20379;&#29992;&#25143;&#20998;&#20139;&#21040;&#26379;&#21451;&#22280;&#12290;</p>
<p><strong>&#39033;&#30446;&#32844;&#36131;&#65306;</strong></p>
<ul>
<li><p>1.&#36127;&#36131;&#36719;&#20214;&#30340;UI&#24320;&#21457;&#12290;</p></li>
<li><p>2.&#36127;&#36131;&#35774;&#22791;&#38598;&#25104;&#19982;&#19994;&#21153;&#36923;&#36753;&#24320;&#21457;&#12290;</p></li>
<li><p>3.&#36127;&#36131;&#25490;&#21517;&#31561;&#31639;&#27861;&#30340;&#35774;&#35745;&#12290;</p></li>
</ul>
<p><strong>&#39033;&#30446;&#19994;&#32489;&#65306;</strong></p>
<p>&#8195;&#8195;&#20316;&#20026;&#20844;&#21496;&#23637;&#21381;&#27604;&#36739;&#21560;&#24341;&#39038;&#23458;&#30340;&#19968;&#20010;&#39033;&#30446;&#65292;&#26159;&#29992;&#25143;&#24230;&#26368;&#38598;&#20013;&#21916;&#29233;&#30340;&#19968;&#20010;&#39033;&#30446;&#65292;&#21560;&#24341;&#20102;&#27604;&#36739;&#22810;&#30340;&#21508;&#30465;&#24066;&#21442;&#35266;&#39046;&#23548;&#30340;&#23089;&#20048;&#27979;&#35797;&#12290;</p>
<p><strong>&#39033;&#30446;UI&#65306;</strong></p>
<div class="figure">
<img src="./&#27668;&#21619;&#28216;&#25103;&#26426;/&#39318;&#39029;1.jpg" alt="&#21151;&#33021;&#39318;&#39029;" />
<p class="caption">&#21151;&#33021;&#39318;&#39029;</p>
</div>
<div class="figure">
<img src="./&#27668;&#21619;&#28216;&#25103;&#26426;/&#39318;&#39029;2.jpg" alt="&#25490;&#34892;&#27036;" />
<p class="caption">&#25490;&#34892;&#27036;</p>
</div>
<div class="figure">
<img src="./&#27668;&#21619;&#28216;&#25103;&#26426;/&#27668;&#21619;&#36873;&#25321;&#39064;0.jpg" alt="&#39064;&#22411;&#35828;&#26126;" />
<p class="caption">&#39064;&#22411;&#35828;&#26126;</p>
</div>
<div class="figure">
<img src="./&#27668;&#21619;&#28216;&#25103;&#26426;/&#27668;&#21619;&#36873;&#25321;&#39064;1.jpg" alt="&#27979;&#35797;&#36873;&#25321;&#39033;" />
<p class="caption">&#27979;&#35797;&#36873;&#25321;&#39033;</p>
</div>
<div class="figure">
<img src="./&#27668;&#21619;&#28216;&#25103;&#26426;/&#27668;&#21619;&#36873;&#25321;&#39064;&#32467;&#26524;1.jpg" alt="&#27979;&#35797;&#32467;&#26524;&#25490;&#21517;" />
<p class="caption">&#27979;&#35797;&#32467;&#26524;&#25490;&#21517;</p>
</div>
<H2>
<ol start="7" style="list-style-type: decimal">
<li>&#31354;&#35843;&#38646;&#20214;&#35013;&#37197;&#26816;&#27979;&#31995;&#32479;
</H2></li>
</ol>
<p><strong>&#39033;&#30446;&#25551;&#36848;&#65306;</strong></p>
<p>&#8195;&#8195;&#26412;&#31995;&#32479;&#20026;&#24037;&#21378;&#29983;&#20135;&#31354;&#35843;&#24037;&#33402;&#38450;&#27490;&#23569;&#35013;&#28431;&#35013;&#38646;&#20214;&#30340;&#30417;&#25511;&#31995;&#32479;&#65292;&#36890;&#36807;PLC&#37319;&#38598;&#27599;&#20010;&#38646;&#20214;&#30340;&#20108;&#32500;&#30721;&#65292;&#27599;&#20010;&#24037;&#20301;&#23433;&#35013;&#30340;&#39034;&#24207;&#21644;&#24037;&#24207;&#38646;&#20214;&#65292;&#22312;&#29983;&#20135;&#23436;&#20840;&#26102;&#21028;&#26029;&#26159;&#21542;&#26377;&#28431;&#35013;&#25110;&#32773;&#38169;&#35013;&#30340;&#38646;&#20214;&#65292;&#24182;&#29983;&#25104;&#20108;&#32500;&#30721;&#65292;&#26041;&#20415;&#29992;&#25143;&#36861;&#28335;&#20197;&#21450;&#20449;&#24687;&#21270;&#31649;&#29702;&#65292;&#20854;&#20013;&#27599;&#20010;&#24037;&#20301;&#33267;&#23569;&#26377;&#20010;PLC&#65292;&#19968;&#20010;&#24037;&#20301;&#21487;&#20197;&#23433;&#35013;&#22810;&#20010;&#38646;&#20214;&#25110;&#32773;&#22810;&#36947;&#24037;&#24207;&#65292;&#36890;&#36807;&#22312;&#31995;&#32479;&#37197;&#32622;&#29983;&#25104;&#27599;&#26465;&#29983;&#20135;&#32447;&#38656;&#35201;&#23433;&#35013;&#30340;&#38646;&#20214;&#21644;&#27599;&#20010;&#24037;&#20301;&#38656;&#35201;&#22788;&#29702;&#30340;&#24037;&#33402;&#65292;&#23436;&#25104;&#35774;&#22791;&#24635;&#35013;&#26816;&#27979;&#65292;&#29992;&#25143;&#25226;&#25171;&#21360;&#20986;&#26469;&#30340;&#20108;&#32500;&#30721;&#36148;&#22312;&#23433;&#35013;&#25104;&#30340;&#31354;&#35843;&#21512;&#26684;&#26631;&#24535;&#19978;&#12290;</p>
<p><strong>&#39033;&#30446;&#32844;&#36131;&#65306;</strong></p>
<ul>
<li><p>1.&#36127;&#36131;&#26381;&#21153;&#31471;&#30340;&#24320;&#21457;&#65292;PLC&#35774;&#22791;&#30340;&#38598;&#25104;&#12290;</p></li>
<li><p>2.&#36127;&#36131;&#24037;&#20301;&#24037;&#33402;&#37197;&#32622;&#36923;&#36753;&#19994;&#21153;&#30340;&#24320;&#21457;&#20197;&#21450;&#25968;&#25454;&#30340;&#26597;&#35810;&#12290;</p></li>
<li><p>3.&#24037;&#21378;&#20154;&#21592;&#30340;&#20351;&#29992;&#22521;&#35757;&#21644;&#24120;&#35265;&#38382;&#39064;&#35299;&#20915;&#22521;&#35757;&#12290;</p></li>
</ul>
<p><strong>&#39033;&#30446;&#19994;&#32489;&#65306;</strong></p>
<p>&#8195;&#8195;&#24050;&#32463;&#27491;&#24120;&#36816;&#34892;5&#24180;&#65292;&#30417;&#25511;&#29983;&#20135;&#36816;&#34892;100&#19975;&#21488;&#20197;&#19978;&#31354;&#35843;&#65292;&#26041;&#20415;&#36710;&#38388;&#24037;&#21378;&#25913;&#21160;&#24037;&#24207;&#21644;&#36861;&#28335;&#20135;&#21697;&#30456;&#20851;&#20449;&#24687;&#65292;&#31526;&#21512;&#39038;&#23458;&#20449;&#24687;&#21270;&#26631;&#20934;&#65292;&#33719;&#21462;&#26356;&#22810;&#30340;&#35746;&#21333;&#12290;</p>
<p><strong>&#39033;&#30446;UI&#65306;</strong></p>
<div class="figure">
<img src="./&#31354;&#35843;&#38646;&#20214;&#35013;&#37197;&#26816;&#27979;&#31995;&#32479;/&#24037;&#20301;&#35774;&#32622;.png" alt="&#31354;&#35843;&#32452;&#35013;&#24037;&#20301;&#35774;&#32622;" />
<p class="caption">&#31354;&#35843;&#32452;&#35013;&#24037;&#20301;&#35774;&#32622;</p>
</div>
<div class="figure">
<img src="./&#31354;&#35843;&#38646;&#20214;&#35013;&#37197;&#26816;&#27979;&#31995;&#32479;/&#35774;&#22791;&#31649;&#29702;.png" alt="&#31354;&#35843;&#32452;&#35013;&#37319;&#38598;&#35774;&#22791;&#31649;&#29702;" />
<p class="caption">&#31354;&#35843;&#32452;&#35013;&#37319;&#38598;&#35774;&#22791;&#31649;&#29702;</p>
</div>
<div class="figure">
<img src="./&#31354;&#35843;&#38646;&#20214;&#35013;&#37197;&#26816;&#27979;&#31995;&#32479;/&#35013;&#37197;&#24635;&#25104;.png" alt="&#31354;&#35843;&#32452;&#35013;&#35013;&#37197;&#24635;&#25104;" />
<p class="caption">&#31354;&#35843;&#32452;&#35013;&#35013;&#37197;&#24635;&#25104;</p>
</div>
<div class="figure">
<img src="./&#31354;&#35843;&#38646;&#20214;&#35013;&#37197;&#26816;&#27979;&#31995;&#32479;/&#29983;&#20135;&#35760;&#24405;&#26597;&#35810;2.png" alt="&#31354;&#35843;&#32452;&#35013;&#24037;&#20301;&#35774;&#32622;" />
<p class="caption">&#31354;&#35843;&#32452;&#35013;&#24037;&#20301;&#35774;&#32622;</p>
</div>
<div class="figure">
<img src="./&#31354;&#35843;&#38646;&#20214;&#35013;&#37197;&#26816;&#27979;&#31995;&#32479;/&#35013;&#37197;&#24635;&#25104;&#26597;&#35810;.png" alt="&#31354;&#35843;&#32452;&#35013;&#37319;&#38598;&#35774;&#22791;&#31649;&#29702;" />
<p class="caption">&#31354;&#35843;&#32452;&#35013;&#37319;&#38598;&#35774;&#22791;&#31649;&#29702;</p>
</div>
<H2>
<ol start="8" style="list-style-type: decimal">
<li>&#27668;&#21619;&#28065;&#29615;&#28846;
</H2></li>
</ol>
<p><strong>&#39033;&#30446;&#25551;&#36848;&#65306;</strong></p>
<p>&#8195;&#8195;&#26412;&#31995;&#32479;&#36890;&#36807;&#25668;&#20687;&#22836;&#25429;&#25417;&#20154;&#33080;(&#30446;&#21069;&#20351;&#29992;Caffe&#27169;&#22411;&#25552;&#39640;&#20102;&#20154;&#33080;&#35782;&#21035;&#20934;&#30830;&#24230;&#65292;&#33021;&#36866;&#24212;&#27604;&#36739;&#24046;&#30340;&#29615;&#22659;)&#65292;&#26681;&#25454;&#20154;&#33080;(&#22810;&#20010;&#20154;&#33080;&#26102;&#38145;&#23450;&#36317;&#31163;&#36817;&#65292;&#35782;&#21035;&#24230;&#27604;&#36739;&#39640;&#30340;&#30340;&#19968;&#20010;)&#23545;&#24212;&#22312;&#25668;&#20687;&#22836;&#20301;&#32622;&#21457;&#36865;&#25351;&#20196;&#35843;&#25972;&#26426;&#22120;&#23545;&#20934;&#20154;&#33080;&#65292;&#19981;&#26029;&#26657;&#20934;&#20154;&#29289;&#25152;&#22312;&#25668;&#20687;&#22836;&#26041;&#20301;&#65292;&#35745;&#31639;&#20998;&#26512;&#20986;&#30446;&#26631;&#27604;&#36739;&#31283;&#23450;&#26102;&#21457;&#36865;&#25351;&#20196;&#25511;&#21046;&#35774;&#22791;&#29983;&#25104;&#27668;&#21619;&#28065;&#29615;&#65292;&#21943;&#21457;&#20855;&#26377;&#28065;&#29615;&#29366;&#30340;&#27668;&#21619;&#26469;&#21560;&#24341;&#32463;&#36807;&#24215;&#38138;&#38376;&#21475;&#30340;&#29992;&#25143;&#12290;</p>
<p><strong>&#39033;&#30446;&#32844;&#36131;&#65306;</strong></p>
<ul>
<li><p>1.&#36127;&#36131;OpenCv&#20154;&#33080;&#35782;&#21035;&#65292;&#34425;&#36719;&#20154;&#33080;&#35782;&#21035;&#65292;EmguCv&#20154;&#33080;&#35782;&#21035;&#65292;ViewFace&#31561;&#20154;&#33080;&#35782;&#21035;&#30340;&#39044;&#30740;&#21644;&#36873;&#22411;&#12290;</p></li>
<li><p>1.&#36127;&#36131;&#24341;&#20837;OpenCv&#30340;&#20154;&#33080;&#35782;&#21035;&#65292;&#23450;&#20301;&#31639;&#27861;&#30340;&#21407;&#29702;&#30740;&#31350;&#65292;&#35774;&#22791;&#25511;&#21046;&#30340;&#24320;&#21457;&#12290;</p></li>
<li><p>2.&#36127;&#36131;&#31532;&#20108;&#29256;&#26412;&#25216;&#26415;&#21407;&#29702;&#25913;&#36827;&#20248;&#21270;&#21450;&#37096;&#32626;&#35774;&#35745;&#65292;&#24320;&#21457;&#21160;&#24577;&#36319;&#36394;&#31639;&#27861;&#20197;&#21450;&#20154;&#33080;&#20301;&#32622;&#21644;&#23454;&#38469;&#28065;&#29615;&#28846;&#20301;&#32622;&#30340;&#26657;&#39564;&#31639;&#27861;&#12290;</p></li>
<li><p>3.&#24341;&#20837;&#20154;&#33080;&#35782;&#21035;&#27169;&#22411;Caffe&#27169;&#22411;&#21644;&#20248;&#21270;&#38452;&#26263;&#29615;&#22659;&#19979;&#35270;&#39057;&#22270;&#20687;&#30340;&#26174;&#31034;&#20197;&#21450;&#19981;&#35782;&#21035;&#30340;&#38382;&#39064;&#12290;</p></li>
<li><p>4.&#20248;&#21270;&#38750;&#24037;&#19994;&#25668;&#20687;&#22836;&#19981;&#33021;7*24&#23567;&#26102;&#27491;&#24120;&#24037;&#20316;&#20197;&#21450;&#40657;&#33394;&#30028;&#38754;&#19981;&#33391;&#35782;&#21035;&#29575;&#30340;&#38382;&#39064;&#12290;</p></li>
<li><p>5.&#24320;&#21457;&#35270;&#39057;&#25511;&#20214;&#65292;&#21487;&#20197;&#38598;&#25104;&#22810;&#20010;&#35774;&#22791;&#65292;&#31867;&#20284;&#20110;&#35270;&#39057;&#30417;&#25511;&#31995;&#32479;&#12290;</p></li>
<li><p>6.&#30740;&#31350;&#28065;&#29615;&#28846;&#21407;&#29702;&#20197;&#21450;&#21487;&#31934;&#24230;&#25511;&#21046;&#30340;&#21407;&#29702;&#21644;&#32452;&#32455;&#35780;&#23457;&#25511;&#21046;&#31639;&#27861;&#12290;</p></li>
</ul>
<p><strong>&#39033;&#30446;&#19994;&#32489;&#65306;</strong></p>
<p>&#8195;&#8195;&#20316;&#20026;&#20844;&#21496;&#30340;&#26368;&#26680;&#24515;&#20135;&#21697;&#20043;&#19968;&#65292;&#26032;&#24320;&#21457;&#20135;&#21697;&#20013;&#21807;&#19968;&#26377;&#19987;&#21033;&#26435;&#30340;&#39033;&#30446;&#65292;&#22312;&#23637;&#20250;&#19978;&#21560;&#24341;&#24456;&#22810;&#29992;&#25143;&#30340;&#38738;&#30544;&#12290;</p>
<p><strong>&#39033;&#30446;UI&#65306;</strong></p>
<div class="figure">
<img src="./&#27668;&#21619;&#28065;&#29615;&#28846;&#31995;&#32479;/&#28065;&#29615;&#28846;V2.png" alt="&#21551;&#21160;&#30028;&#38754;&#20026;&#22810;&#25668;&#20687;&#22836;&#31995;&#32479;" />
<p class="caption">&#21551;&#21160;&#30028;&#38754;&#20026;&#22810;&#25668;&#20687;&#22836;&#31995;&#32479;</p>
</div>
<div class="figure">
<img src="./&#27668;&#21619;&#28065;&#29615;&#28846;&#31995;&#32479;/&#27668;&#21619;&#28065;&#29615;&#28846;V1.jpg" alt="&#21333;&#20010;&#25668;&#20687;&#22836;&#26102;" />
<p class="caption">&#21333;&#20010;&#25668;&#20687;&#22836;&#26102;</p>
</div>
<H2>
<ol start="9" style="list-style-type: decimal">
<li>IP&#24191;&#25773;&#31995;&#32479;
</H2></li>
</ol>
<p><strong>&#39033;&#30446;&#25551;&#36848;&#65306;</strong></p>
<p>&#8195;&#8195;&#35813;&#39033;&#30446;&#20027;&#35201;&#38024;&#23545;&#27743;&#35199;&#30465;&#26576;&#21439;&#32423;&#24191;&#25773;&#31995;&#32479;&#30340;&#24179;&#21488;&#25913;&#36896;&#65292;&#37325;&#26032;&#24320;&#21457;&#36866;&#29992;&#20110;&#29616;&#20195;&#24191;&#25773;&#31995;&#32479;&#30340;&#24179;&#21488;&#65292;&#19982;&#24191;&#30005;&#24635;&#23616;&#21512;&#20316;&#30340;&#24191;&#25773;&#31995;&#32479;&#35797;&#28857;&#39033;&#30446;&#65292;&#24182;&#25512;&#24191;&#21040;&#27827;&#21271;&#40481;&#27901;&#21439;&#24191;&#25773;&#31995;&#32479;&#12290;&#29616;&#20195;IP&#24191;&#25773;&#31995;&#32479;&#20027;&#35201;&#26159;&#25226;&#26381;&#21153;&#31471;&#37096;&#32626;&#22312;&#21439;&#32423;&#24191;&#25773;&#24179;&#21488;&#26381;&#21153;&#22120;&#19978;&#65292;&#36890;&#36807;IP&#32593;&#32476;&#65292;&#30465;&#24066;&#32423;&#24191;&#25773;&#24179;&#21488;&#36890;&#36807;IP&#32593;&#32476;&#20256;&#36755;&#38899;&#39057;&#21644;XML&#25991;&#20214;&#25351;&#20196;&#25511;&#21046;&#21439;&#32423;&#21450;&#20065;&#38215;&#24191;&#25773;&#31995;&#32479;&#19978;&#65292;&#20065;&#38215;&#24191;&#25773;&#31995;&#32479;&#25509;&#25910;&#21040;&#25351;&#20196;&#25171;&#24320;&#26412;&#21306;&#22495;&#24191;&#25773;&#25509;&#25910;&#24182;&#25773;&#25918;&#38899;&#39057;&#25991;&#20214;&#25110;&#32773;&#23454;&#26102;&#24191;&#25773;&#65292;&#21508;&#20065;&#38215;&#20063;&#21487;&#20197;&#36890;&#36807;&#35831;&#27714;&#21439;&#32423;&#24179;&#21488;&#35831;&#27714;&#24191;&#25773;&#65292;&#24212;&#29992;&#20110;&#24212;&#24613;&#20107;&#20214;&#24191;&#25773;&#36890;&#30693;&#25110;&#32773;&#20065;&#38215;&#30005;&#21488;&#25773;&#25918;&#12290;</p>
<p><strong>&#39033;&#30446;&#32844;&#36131;&#65306;</strong></p>
<ul>
<li>1.&#21442;&#19982;&#24191;&#30005;&#24635;&#23616;IP&#24191;&#25773;&#31995;&#32479;&#21327;&#35758;&#30340;&#21046;&#23450;&#12290;</li>
<li>2.&#36127;&#36131;&#20282;&#26381;&#26381;&#21153;&#21450;&#25773;&#25918;&#26381;&#21153;&#36719;&#20214;&#24320;&#21457;&#12290;</li>
<li>3.&#36127;&#36131;&#26680;&#24515;&#26381;&#21153;HTTP&#21327;&#35758;&#30340;&#29305;&#27530;&#26381;&#21153;&#30340;&#24320;&#21457;&#65292;&#25509;&#25910;&#19978;&#32423;&#24191;&#25773;&#25351;&#20196;&#24182;UDP&#32452;&#25773;&#21040;&#21508;&#20010;&#32456;&#31471;&#12290;</li>
<li>4.&#24341;&#20837;Gmap.net&#32452;&#20214;&#22320;&#22270;&#26174;&#31034;&#21508;&#32423;&#20065;&#38215;&#30340;IP&#24191;&#25773;&#32456;&#31471;&#29366;&#24577;&#12290;</li>
<li>5.&#24320;&#21457;&#20282;&#26381;&#20998;&#27493;&#24335;&#22788;&#29702;&#31995;&#32479;&#65292;&#36890;&#36807;&#20282;&#26381;&#20027;&#26426;&#20998;&#37197;&#20174;IP&#38899;&#26609;&#22238;&#20256;&#22238;&#26469;&#30340;&#20449;&#24687;&#25351;&#20196;&#65292;&#20998;&#27493;&#31995;&#32479;&#22788;&#29702;&#35299;&#26512;&#25351;&#20196;&#21644;&#20445;&#23384;&#38899;&#26609;&#25968;&#25454;&#21040;Redis&#19978;&#65292;&#22320;&#22270;&#26174;&#31034;&#23545;&#24212;&#38899;&#26609;&#22320;&#28857;&#21644;&#20449;&#24687;&#12290;</li>
<li>6.&#25991;&#36716;&#35821;&#27169;&#22359;&#30340;&#36873;&#22411;&#21450;&#38598;&#25104;&#30701;&#20449;&#25773;&#25918;&#12290;</li>
<li>7.&#35299;&#20915;&#24191;&#25773;&#31995;&#32479;VLAN&#21010;&#20998;&#38382;&#39064;&#65292;&#21327;&#21161;&#24037;&#31243;&#37096;&#24635;&#32463;&#29702;&#22788;&#29702;&#23433;&#35013;&#38382;&#39064;&#12290;</li>
<li>8.&#29616;&#22330;&#35299;&#20915;&#32593;&#32476;&#20256;&#25773;&#38382;&#39064;&#65292;&#26080;&#24847;&#35774;&#32622;&#30340;TTL&#20026;1&#23548;&#33268;&#38899;&#39057;&#25351;&#20196;&#21253;&#26080;&#27861;&#19979;&#21457;&#21040;&#20854;&#23427;&#36335;&#30001;&#22120;&#19978;&#12290;</li>
<li>9.&#22521;&#35757;&#21508;&#20065;&#38215;&#24191;&#25773;&#21592;&#21644;&#25351;&#23548;&#24037;&#31243;&#37096;&#20154;&#21592;&#37096;&#32626;&#27979;&#35797;&#38899;&#26609;&#23433;&#35013;&#38382;&#39064;&#12290;</li>
</ul>
<p><strong>&#39033;&#30446;&#19994;&#32489;&#65306;</strong></p>
<ul>
<li><p>1.&#25104;&#21151;&#24212;&#29992;&#21040;&#26449;&#26449;&#36890;&#35797;&#28857;&#39033;&#30446;&#65292;&#24182;&#24471;&#21040;&#30465;&#24066;&#39046;&#23548;&#30340;&#32943;&#23450;&#12290;</p></li>
<li><p>2.&#26041;&#20415;&#19979;&#19968;&#38454;&#27573;&#30340;&#25512;&#24191;&#24212;&#29992;&#65292;&#24320;&#21457;&#30340;&#35797;&#28857;&#31995;&#32479;&#39033;&#30446;&#21442;&#19982;&#20840;&#22269;&#20065;&#38215;&#24191;&#25773;&#25237;&#26631;&#12290;</p></li>
<li><p>3.&#26631;&#26438;&#39033;&#30446;&#33719;&#24471;&#20041;&#20044;&#24066;&#65292;&#37329;&#21326;&#24066;&#31561;&#24066;&#24191;&#25773;&#31995;&#32479;&#30340;&#25307;&#26631;&#12290;</p></li>
<li><p>4.&#20840;&#22269;&#20849;&#37096;&#32626;10&#22810;&#19975;&#20010;&#38899;&#26609;&#35774;&#22791;&#21644;&#22810;&#20010;&#30465;&#24066;&#21439;&#24191;&#25773;&#30340;&#26381;&#21153;&#24212;&#29992;&#37096;&#32626;&#12290;</p></li>
</ul>
<p><strong>&#39033;&#30446;UI&#65306;</strong></p>
<div class="figure">
<img src="./IP&#24191;&#25773;&#31995;&#32479;/TN9515&#38899;&#26609;.jpg" alt="TN9515&#38899;&#26609;" />
<p class="caption">TN9515&#38899;&#26609;</p>
</div>
<div class="figure">
<img src="./IP&#24191;&#25773;&#31995;&#32479;/TN4200IP&#38899;&#39057;&#32534;&#30721;&#22120;.jpg" alt="TN4200IP&#38899;&#39057;&#32534;&#30721;&#22120;" />
<p class="caption">TN4200IP&#38899;&#39057;&#32534;&#30721;&#22120;</p>
</div>
<div class="figure">
<img src="./IP&#24191;&#25773;&#31995;&#32479;/softscreen.jpg" alt="&#31995;&#32479;&#23637;&#31034;&#22823;&#23631;" />
<p class="caption">&#31995;&#32479;&#23637;&#31034;&#22823;&#23631;</p>
</div>
<div class="figure">
<img src="./IP&#24191;&#25773;&#31995;&#32479;/&#28246;&#21271;&#24191;&#25773;&#31995;&#32479;&#22238;&#20256;.jpg" alt="&#30417;&#21033;&#21439;IP&#38899;&#26609;&#22238;&#20256;&#22320;&#22270;&#26174;&#31034;" />
<p class="caption">&#30417;&#21033;&#21439;IP&#38899;&#26609;&#22238;&#20256;&#22320;&#22270;&#26174;&#31034;</p>
</div>
<H2>
<ol start="10" style="list-style-type: decimal">
<li>&#24067;&#26009;&#21253;&#35013;&#31995;&#32479;
</H2></li>
</ol>
<p><strong>&#39033;&#30446;&#25551;&#36848;&#65306;</strong></p>
<p>&#8195;&#8195;&#35813;&#39033;&#30446;&#20027;&#35201;&#38024;&#23545;&#21407;&#26377;&#36710;&#38388;&#24067;&#26009;&#21253;&#35013;&#29983;&#20135;&#32447;&#36827;&#34892;&#33258;&#21160;&#21270;&#25913;&#36896;&#30340;&#12290;&#36890;&#36807;&#39564;&#24067;&#20154;&#21592;&#39564;&#24067;&#24182;&#30830;&#35748;&#24067;&#30340;&#36136;&#37327;&#65292;&#24405;&#20837;&#21040;&#31995;&#32479;&#20013;&#28982;&#21518;&#19978;&#32447;&#21040;&#21253;&#35013;&#32447;&#65292;&#26381;&#21153;&#31471;&#25509;&#25910;&#21040;4&#26465;&#29983;&#20135;&#32447;&#30340;&#19978;&#32447;&#24067;&#26009;&#20449;&#24687;&#32047;&#31215;&#36215;&#26469;&#65292;&#24403;&#26576;&#26465;&#29983;&#20135;&#32447;&#26576;&#20010;&#25209;&#27425;&#36798;&#21040;&#25972;&#31665;&#21253;&#35013;&#35201;&#27714;&#26102;&#65292;&#26381;&#21153;&#31471;&#36890;&#30693;PLC&#26576;&#26465;&#32447;&#19978;&#32447;&#24067;&#26009;&#36827;&#34892;&#21253;&#35013;&#65292;&#24182;&#25171;&#21360;&#24067;&#26009;&#25972;&#31665;&#20449;&#24687;&#65292;PLC&#25509;&#25910;&#25351;&#20196;&#65292;&#27599;&#19978;&#19968;&#20010;&#24067;&#26009;&#21367;&#23601;&#36890;&#30693;&#26381;&#21153;&#31471;&#25171;&#21360;&#23545;&#24212;&#24067;&#26009;&#30340;&#20108;&#32500;&#30721;&#65292;PLC&#25509;&#25910;&#21040;&#20108;&#32500;&#30721;&#25171;&#21360;&#25104;&#21151;&#30340;&#28040;&#24687;&#21518;&#21253;&#35013;&#24067;&#26009;&#24182;&#33258;&#21160;&#25226;&#20108;&#32500;&#30721;&#36148;&#22312;&#24067;&#26009;&#19978;&#65292;&#24403;&#21253;&#35013;&#23436;&#25972;&#31665;&#21518;&#65292;&#32447;&#19978;&#31995;&#32479;&#30340;&#26426;&#22120;&#20154;&#25509;&#25910;&#26381;&#21153;&#31471;&#20256;&#36807;&#26469;&#30340;&#24067;&#26009;&#25972;&#31665;&#28040;&#24687;&#36827;&#34892;&#25171;&#21253;&#21644;&#23553;&#35013;&#65292;&#24182;&#25226;&#21253;&#35013;&#22909;&#30340;&#31665;&#23376;&#20256;&#36865;&#21040;&#30721;&#22427;&#26426;&#22120;&#26049;&#65292;&#30721;&#22427;&#26426;&#25509;&#25910;&#21040;&#21040;&#20301;&#24320;&#20851;&#28040;&#24687;&#21644;&#25972;&#31665;&#30340;&#29983;&#20135;&#32447;&#21495;&#25968;&#25454;&#20998;&#37197;&#30721;&#22427;&#65292;&#26381;&#21153;&#31471;&#25509;&#25910;&#21040;&#30721;&#22427;&#23436;&#25104;&#25972;&#22427;&#20449;&#24687;&#21518;&#25171;&#21360;&#23545;&#24212;&#28165;&#21333;&#12290;</p>
<p><strong>&#39033;&#30446;&#32844;&#36131;&#65306;</strong></p>
<ul>
<li><p>1.&#36127;&#36131;&#26381;&#21153;&#36719;&#20214;&#24320;&#21457;&#12290;</p></li>
<li><p>2.&#36127;&#36131;&#37096;&#32626;&#32593;&#32476;&#37197;&#32622;&#65292;&#21327;&#21161;PLC&#24037;&#31243;&#24072;&#35843;&#35797;&#36830;&#36890;&#12290;</p></li>
<li><p>3.&#23458;&#25143;&#31471;&#36719;&#20214;&#30340;&#24320;&#21457;&#65292;&#20179;&#24211;&#31649;&#29702;&#36719;&#20214;&#24320;&#21457;&#12290;</p></li>
<li><p>4.&#32852;&#31995;&#22521;&#35757;&#24037;&#21378;&#21592;&#24037;&#20351;&#29992;&#22521;&#35757;&#12290;</p></li>
</ul>
<p><strong>&#39033;&#30446;&#19994;&#32489;&#65306;</strong></p>
<p>&#8195;&#8195;&#25104;&#21151;&#24212;&#29992;&#21040;&#23458;&#25143;&#29983;&#20135;&#20013;&#65292;&#23558;&#21407;&#26469;&#25163;&#24037;&#21253;&#35013;&#24067;&#26009;&#33258;&#21160;&#21270;&#65292;&#20449;&#24687;&#21270;&#65292;&#26041;&#20415;&#36861;&#28335;&#35760;&#24405;&#65292;&#23454;&#29616;&#30446;&#26631;&#29983;&#20135;&#21253;&#35013;&#24067;&#26009;&#27599;&#22825;1000&#22810;&#31665;&#12290;</p>
<p><strong>&#39033;&#30446;UI&#65306;</strong></p>
<div class="figure">
<img src="./&#24067;&#26009;&#21253;&#35013;&#31995;&#32479;/&#24067;&#26009;&#21253;&#35013;&#31995;&#32479;&#23458;&#25143;&#31471;.png" alt="&#19978;&#32447;&#32456;&#31471;" />
<p class="caption">&#19978;&#32447;&#32456;&#31471;</p>
</div>
<div class="figure">
<img src="./&#24067;&#26009;&#21253;&#35013;&#31995;&#32479;/&#20179;&#20648;&#31649;&#29702;&#31995;&#32479;.png" alt="&#29983;&#20135;&#35745;&#21010;&#31995;&#32479;" />
<p class="caption">&#29983;&#20135;&#35745;&#21010;&#31995;&#32479;</p>
</div>
<div class="figure">
<img src="./&#24067;&#26009;&#21253;&#35013;&#31995;&#32479;/&#24067;&#26009;&#27969;&#27700;&#32447;.jpg" alt="&#24067;&#26009;&#27969;&#27700;&#32447;" />
<p class="caption">&#24067;&#26009;&#27969;&#27700;&#32447;</p>
</div>
<div class="figure">
<img src="./&#24067;&#26009;&#21253;&#35013;&#31995;&#32479;/&#25171;&#21253;&#26426;.jpg" alt="&#25171;&#21253;&#26426;" />
<p class="caption">&#25171;&#21253;&#26426;</p>
</div>
<div class="figure">
<img src="./&#24067;&#26009;&#21253;&#35013;&#31995;&#32479;/&#38598;&#20013;&#24335;PLC&#25511;&#21046;&#26588;.jpg" alt="PLC&#25511;&#21046;&#26588;" />
<p class="caption">PLC&#25511;&#21046;&#26588;</p>
</div>
<div class="figure">
<img src="./&#24067;&#26009;&#21253;&#35013;&#31995;&#32479;/&#30721;&#22427;&#26426;&#22120;&#20154;&#25644;&#36816;&#31665;&#23376;.jpg" alt="&#30721;&#22427;&#26426;" />
<p class="caption">&#30721;&#22427;&#26426;</p>
</div>
<H2>
<ol start="11" style="list-style-type: decimal">
<li>&#40657;&#30005;&#21488;&#30417;&#25511;&#31995;&#32479;
</H2></li>
</ol>
<p><strong>&#39033;&#30446;&#25551;&#36848;&#65306;</strong></p>
<p>&#8195;&#8195;&#35813;&#39033;&#30446;&#20027;&#35201;&#26159;&#38024;&#23545;&#22478;&#24066;&#21306;&#22495;&#20869;&#19968;&#20123;&#38750;&#27861;&#30005;&#21488;&#30340;&#12290;&#36890;&#36807;&#22312;&#22478;&#24066;&#21306;&#22495;&#20869;&#25237;&#25918;&#30417;&#25511;&#35774;&#22791;&#65292;&#24182;&#22312;&#22320;&#22270;&#32452;&#20214;&#19978;&#26174;&#31034;(Gmap.Net)&#65292;&#35774;&#22791;&#37319;&#38598;&#21508;&#20010;&#39057;&#36947;&#30340;&#39057;&#35889;&#25968;&#25454;&#21644;&#38899;&#39057;&#25968;&#25454;&#65292;&#30417;&#21548;&#25773;&#25918;PCM&#27969;&#25968;&#25454;&#65307;&#20351;&#29992;4G&#27169;&#22359;&#36890;&#36807;TCP&#19978;&#20256;&#21040;&#26381;&#21153;&#31471;&#65292;&#26381;&#21153;&#31471;&#35299;&#26512;&#39057;&#35889;&#25968;&#25454;&#20998;&#26512;&#24322;&#24120;&#24182;&#20445;&#23384;&#65292;&#21516;&#26102;&#21478;&#19968;&#26381;&#21153;&#30417;&#21548;&#38899;&#39057;&#65292;&#20351;&#29992;&#35821;&#38899;&#36716;&#25991;&#23383;(&#31185;&#22823;&#35759;&#39134;)&#33258;&#21160;&#36807;&#34385;&#24322;&#24120;&#20449;&#24687;&#65292;&#24182;&#22312;&#22320;&#22270;&#19978;&#26174;&#31034;&#21508;&#20010;&#28857;&#30340;&#30417;&#25511;&#29366;&#24577;&#65292;&#23545;&#20135;&#29983;&#30340;&#24322;&#24120;&#29983;&#25104;&#25253;&#35686;&#12290;&#38024;&#23545;&#36825;&#20010;&#39033;&#30446;&#65292;&#19987;&#38376;&#35774;&#35745;&#26550;&#26500;&#20102;&#19968;&#20010;&#26381;&#21153;&#31471;&#65292;&#26381;&#21153;&#31471;&#30001;&#38899;&#39057;&#22788;&#29702;&#27169;&#22359;&#65292;&#26085;&#24535;&#27169;&#22359;&#65292;&#36890;&#20449;&#27169;&#22359;&#65292;&#29992;&#25143;&#27169;&#22359;&#65292;&#19994;&#21153;&#22788;&#29702;&#27169;&#22359;&#65292;JSON&#27169;&#22359;&#31561;&#32452;&#25104;&#65292;&#19994;&#21153;&#22788;&#29702;&#27169;&#22359;&#25226;&#21508;&#20010;&#21151;&#33021;&#27169;&#22359;&#32852;&#25509;&#36215;&#26469;&#12290;&#40657;&#30005;&#21488;&#32508;&#21512;&#32593;&#32476;&#26597;&#25214;&#31995;&#32479;&#26159;&#36890;&#36807;&#23545;&#26576;&#19968;&#22478;&#24066;&#25110;&#29305;&#23450;&#21306;&#22495;&#24067;&#32622;&#22810;&#20010;&#23567;&#22411;&#8220;&#26080;&#32447;&#30005;&#37319;&#38598;&#32456;&#31471;&#8221;&#65292;&#23545;&#24191;&#25773;&#39057;&#27573;&#36827;&#34892;&#37325;&#28857;&#30417;&#27979;&#65292;&#21487;&#20197;&#23454;&#26102;&#39640;&#25928;&#30340;&#26597;&#25214;&#38750;&#27861;&#40657;&#30005;&#21488;&#65292;&#23545;&#26597;&#25214;&#20986;&#26469;&#30340;&#38750;&#27861;&#39057;&#29575;&#20449;&#21495;&#36827;&#34892;&#23454;&#26102;&#27604;&#23545;&#65292;&#23545;&#35299;&#35843;&#20986;&#26469;&#30340;&#38899;&#39057;&#25968;&#25454;&#36827;&#34892;&#23454;&#26102;&#35760;&#24405;&#65292;&#21487;&#24555;&#36895;&#30340;&#26597;&#25214;&#12289;&#20998;&#26512;&#24182;&#21028;&#26029;&#40657;&#30005;&#21488;&#30340;&#23384;&#22312;&#65292;&#26377;&#25928;&#30340;&#25552;&#39640;&#20102;&#26597;&#25214;&#40657;&#30005;&#21488;&#30340;&#25216;&#26415;&#25163;&#27573;&#65292;&#25670;&#33073;&#20102;&#20256;&#32479;&#30417;&#27979;&#35774;&#22791;&#30340;&#23616;&#38480;&#65292;&#26377;&#25928;&#36991;&#20813;&#20256;&#32479;&#30417;&#27979;&#35774;&#22791;&#19981;&#28789;&#27963;&#30340;&#29305;&#24615;&#65292;&#20174;&#32780;&#23558;&#23545;&#8220;&#40657;&#24191;&#25773;&#8221;&#20390;&#27979;&#30001;&#34987;&#21160;&#21464;&#20026;&#20027;&#21160;&#65292;&#26377;&#25928;&#25552;&#39640;&#20102;&#24037;&#20316;&#25928;&#29575;&#12290;</p>
<p><strong>&#39033;&#30446;&#32844;&#36131;&#65306;</strong></p>
<ul>
<li><p>1.&#36127;&#36131;&#26381;&#21153;&#31471;&#36719;&#20214;&#24320;&#21457;&#12290;</p></li>
<li><p>2.&#36127;&#36131;&#37096;&#32626;&#35774;&#22791;&#32593;&#32476;&#37197;&#32622;&#65292;&#20197;&#21450;&#30417;&#25511;&#35774;&#22791;&#30340;&#37197;&#32622;&#12290;</p></li>
<li><p>3.&#36127;&#36131;&#23458;&#25143;&#31471;&#36719;&#20214;&#30340;&#24320;&#21457;&#65292;&#25351;&#23548;&#26032;&#21592;&#24037;&#24320;&#21457;&#29992;&#25143;&#27169;&#22359;&#21644;&#25968;&#25454;&#26597;&#35810;&#27169;&#22359;&#31561;&#12290;</p></li>
<li><p>4.&#36127;&#36131;&#39033;&#30446;&#24320;&#21457;&#36807;&#31243;&#30340;&#21508;&#20010;&#38454;&#27573;&#25991;&#26723;&#32534;&#20889;&#65292;&#24182;&#36890;&#36807;&#36136;&#37327;&#20307;&#31995;&#30340;&#35748;&#35777;&#36890;&#36807;&#12290;</p></li>
</ul>
<p><strong>&#39033;&#30446;&#19994;&#32489;&#65306;</strong></p>
<p>&#8195;&#8195;&#20316;&#20026;&#30417;&#25511;&#38750;&#27861;&#24191;&#25773;&#30340;&#26381;&#21153;&#24212;&#29992;&#20110;&#24191;&#25773;&#30005;&#35270;&#37096;&#38376;&#30340;&#25506;&#27979;&#31995;&#32479;&#65292;&#25104;&#20026;&#30417;&#27979;&#21040;&#21335;&#20140;&#26576;&#22320;&#30340;&#19968;&#20123;&#40657;&#30005;&#21488;&#12290;</p>
<p><strong>&#39033;&#30446;UI&#65306;</strong></p>
<div class="figure">
<img src="./&#40657;&#30005;&#21488;&#32508;&#21512;&#32593;&#32476;&#26597;&#25214;&#31995;&#32479;/&#30417;&#25511;&#28857;&#22320;&#22270;.jpg" alt="&#30417;&#25511;&#28857;&#22320;&#22270;&#26174;&#31034;" />
<p class="caption">&#30417;&#25511;&#28857;&#22320;&#22270;&#26174;&#31034;</p>
</div>
<div class="figure">
<img src="./&#40657;&#30005;&#21488;&#32508;&#21512;&#32593;&#32476;&#26597;&#25214;&#31995;&#32479;/&#30417;&#25511;&#28857;&#22320;&#22270;&#21450;&#30417;&#25511;&#28857;&#20449;&#24687;.jpg" alt="&#30417;&#25511;&#28857;&#30456;&#20851;&#20449;&#24687;" />
<p class="caption">&#30417;&#25511;&#28857;&#30456;&#20851;&#20449;&#24687;</p>
</div>
<div class="figure">
<img src="./&#40657;&#30005;&#21488;&#32508;&#21512;&#32593;&#32476;&#26597;&#25214;&#31995;&#32479;/&#37319;&#38598;&#30340;&#39057;&#35889;&#25968;&#25454;.jpg" alt="&#30417;&#25511;&#24471;&#21040;&#30340;&#39057;&#35889;" />
<p class="caption">&#30417;&#25511;&#24471;&#21040;&#30340;&#39057;&#35889;</p>
</div>
<p><strong><a href="./otherproject.md">&#20854;&#23427;&#39033;&#30446;</a></strong></p>
</body>
</html>
